Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Play in Full

source: །བམ་པོ་དང་པོ།
en: Chapter 1

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་ཁྲི་ཉིས་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་། ཚེ་དང་ལྡན་པ་མིང་ཆེན་དང་། ཚེ་དང་ལྡན་པ་བཟང་པོ་དང་། ཚེ་དང་ལྡན་པ་གྲགས་སྦྱིན་དང་། ཚེ་དང་ལྡན་པ་དྲི་མ་མེད་དང་། ཚེ་དང་ལྡན་པ་ལག་བཟངས་དང་། ཚེ་དང་ལྡན་པ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་བ་ལང་བདག་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ག་ཡཱ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱའི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀ་པི་ན་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་གསུས་པོ་ཆེ་དང་། ཚེ་དང་ལྡན་པ་སྐུལ་བྱེད་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བྱེད་དང་། ཚེ་དང་ལྡན་པ་འུག་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་ནམ་གྲུ་དང་། ཚེ་དང་ལྡན་པ་སེང་ལྡེང་ནགས་པ་དང་། ཚེ་དང་ལྡན་པ་དོན་ཡོད་རྒྱལ་པོ་དང་། ཚེ་དང་ལྡན་པ་ཕ་རོལ་ཏུ་འགྲོ་བ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་བ་ཀུ་ལ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་། ཚེ་དང་ལྡན་པ་ལེགས་འོངས་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དེ་དག་ལ་སོགས་པ་དགེ་སློང་ཁྲི་ཉིས་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was staying in Śrāvastī at Jeta Grove, in the park of Anāthapiṇḍada, along with a great saṅgha of twelve thousand monks. Among them were venerable Ājñāta­kauṇḍinya, venerable Aśvajit, venerable Bāṣpa, venerable Mahānāma, venerable Bhadrika, venerable Yaśodeva, venerable Vimala, venerable Subāhu, venerable Pūrṇa, venerable Gavāṃpati, venerable Urubilvā Kāśyapa, venerable Nadīkāśyapa, venerable Gayākāśyapa, venerable Śāriputra, venerable Mahā­maudgalyāyana, venerable Mahākāśyapa, venerable Mahākātyāyana, venerable Mahākapphiṇa, venerable Kauṣṭhila, venerable Cunda, venerable Pūrṇa­maitrāyaṇī­putra, venerable Aniruddha, venerable Nandika, venerable Kampila, venerable Subhūti, venerable Revata, venerable Khadiravaṇika, venerable Amogharāja, venerable Mahāpāraṇika, venerable Vakkula, venerable Nanda, venerable Rāhula, venerable Svāgata, and venerable Ānanda.

source: །བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་ཐམས་ཅད་ཀྱང་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ལས་ངེས་པར་སྐྱེས་པ།
en: Along with these monks were 32,000 bodhisattvas, all of whom had only a single birth remaining and were adept in all the perfections of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་རྩེ་བ། བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཐམས་ཅད་ཐོབ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་ཐམས་ཅད་ཐོབ་པ།
en: They enjoyed all the superknowledges of the bodhisattvas and had attained all the dhāraṇīs and all the confidence of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ། བྱང་ཆུབ་སེམས་དཔའི་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་དབང་ཐོབ་པ།
en: They had completed all the aspirations of the bodhisattvas, understood and realized all discriminating knowledges of the bodhisattvas, and gained mastery over all the absorptions of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ཐོབ་པ། བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐམས་ཅད་ལ་ཞུགས་པ།
en: They had obtained all the powers of the bodhisattvas and dwelt with all the patience of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་རབ་ཏུ་རྫོགས་པ་ཤ་སྟག་སྟེ།
en: Indeed each of them had completed all the bodhisattva grounds.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེའི་ཏོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་གྲུབ་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པ་རབ་ཏུ་ཞི་བའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་རྟག་པར་སྦྱོར་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེར་སེམས་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་དང་ཡང་ཐབས་ཅིག་གོ། །
en: Foremost among them were the bodhisattva great being Maitreya, the bodhisattva great being Dharaṇīśvara­rāja, the bodhisattva great being Siṃhaketu, the bodhisattva great being Siddhārtha­mati, the bodhisattva great being Praśānta­cāritra­mati, the bodhisattva great being Prati­saṃvitprāpta, the bodhisattva great being Nityodyukta, and the bodhisattva great being Mahā­karuṇā­candrin.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན། འཁོར་བཞི་དང་། རྒྱལ་པོ་དང་། རྒྱལ་པོའི་སྲས་དང་། རྒྱལ་པོའི་བློན་པོ་ཆེན་པོ་དང་། ཆགས་འོག་གི་རྒྱལ་ཕྲན་དང་། རྒྱལ་པོའི་ཞབས་འབྲིང་བ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། འཁོར་གྱི་མི་དང་། གྲོང་ཁྱེར་པ་དང་། ཡུལ་གྱི་མི་དང་། མུ་སྟེགས་ཅན་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། དཔྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས། བླ་མར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པ་བྱས་སོ། །
en: At that time the Blessed One dwelt in the city of Śrāvastī, where he was revered by his fourfold retinue, as well as by kings, princes, royal ministers, vassal kings, and attendants. Likewise his followers among the military, the priests, the merchants, the householders, and the royal court revered him. Both city dwellers and those who lived in the countryside, as well as the adherents of extremist philosophies, ascetics, priests, logicians, and wandering hermits, also revered him. He was treated as their master and showed great respect.

source: བཅོམ་ལྡན་འདས་ནི་བཟའ་བ་དང་། བཅའ་བ་དང་མྱང་བ་དག་བསོད་ཅིང་མང་བ་དང་། ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རུང་བ་བརྙེས་ཤིང་།
en: Presented with offerings, the Blessed One received abundant savory food and drink, robes, alms bowls, bedding, healing medicines and remedies, and other appropriate necessities. Yet the great wealth and renown he enjoyed were like drops of water rolling off the petals of a lotus flower.

source: བཅོམ་ལྡན་འདས་ནི་བརྙེས་པ་དམ་པ་དང་། གྲགས་པ་དམ་པ་བརྙེས་ཀྱང་པད་མ་ལ་ཆུས་མི་གོས་པ་ལྟར་ཐམས་ཅད་དུ་མ་ཆགས་མ་གོས་པར་བཞུགས་སོ། །
en: The Blessed One remained detached and untainted by it all.

source: བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པ་དང་། སྒྲ་དང་སྙན་པ་ནི་འདི་སྐད་དུ། བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་མངོན་པར་གྲགས་པར་གྱུར་ཏོ།
en: As the Blessed One’s fame spread throughout the world, he became known by various names and epithets, such as the Blessed One, the Worthy One, the Perfectly and Completely Awakened One, He Who Is Both Wise and Virtuous, the Well-Gone One, the Knower of the World, the Peerless Guide Who Tames Beings, the Teacher of Gods and Men, and the Blessed Buddha.

source: །དེ་ནི་སྤྱན་ལྔ་དང་ལྡན་པ་སྟེ། འཇིག་རྟེན་འདི་དང་འཇིག་རྟེན་ཕ་རོལ་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་ལྷ་དང་མིར་བཅས་པ་དག །རང་གིས་མངོན་པར་མཁྱེན་པས་མངོན་དུ་མཛད་ནས་ཉེ་བར་བསྒྲུབས་ཏེ་རབ་ཏུ་སྟོན་ཏོ།
en: Endowed with the fivefold vision, the Blessed One taught the inhabitants of this and other worlds, each with its gods, Māra, Brahmā, monks, nuns, and priests. To all these beings, gods and humans alike, he taught what he himself had realized, and what he had thereby actualized and accomplished.

source: །དེ་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ།
en: The teachings he gave were virtuous in the beginning, virtuous in the middle, and virtuous in the end.

source: ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་དཀར་བའི་ཆོས་སྟོན་ཏེ། ཚངས་པའི་སྤྱོད་པ་ཡང་དག་པར་སྟོན་ཏོ།
en: Sublime in both word and meaning, the Dharma he taught was at once distinct, complete, pure, and wholesome. He taught all these beings how to live a life of purity.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ནམ་གྱི་གུང་ཐུན་ལ། སངས་རྒྱས་ཀྱི་རྒྱན་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པར་གྱུར་ཏོ།
en: One evening during his midnight session, the Blessed One entered a state of deep absorption known as the array of the Buddha’s adornments.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་རྒྱན་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ། སྐད་ཅིག་དེ་ཉིད་ལ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་གཙུག་ཏོར་གྱི་གསེབ་ནས། སྔོན་གྱི་སངས་རྒྱས་རྗེས་སུ་དྲན་པར་བྱ་བ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་སྣང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་བྱུང་སྟེ།
en: The moment he entered into this state of absorption, the ray of light known as the light of wisdom‌ free from attachment that arouses the memory of the buddhas of times past shone forth from his head’s crown extension.

source: དེས་གནས་གཙང་མའི་ལྷའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཚད་མེད་པ་དག་ཡང་དག་པར་བསྐུལ་ཏོ།
en: Illuminating all the pure realms, the light attracted Maheśvara and innumerable other gods.

source: །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་གྱི་ཚོགས་དེ་ལས་བསྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་བྱུང་ངོ་།
en: From the mass of light that radiated from the Thus-Gone One, the following verses of exhortation arose:

source: །ཡེ་ཤེས་འོད་ལྡན་མུན་བཅོམ་འོད་མཛད་པ། །འོད་བཟང་གཟི་བརྗིད་དམ་པ་དྲི་མེད་པ། །སྐུ་ལུས་རབ་ཞི་ཐུགས་དགེ་ཞི་བ་པོ། །ཤཱཀྱའི་སེང་གེ་ཐུབ་དང་ཕྲད་པར་གྱིས།
en: “Come commune with the Sage, the Lion of the Śākyas. Sublime, supremely brilliant, and pure, The light of wisdom he radiates dispels darkness. Peaceful in form, his mind is virtuous and tranquil.

source: །ཡེ་ཤེས་རྒྱ་མཚོ་མཐུ་ཆེན་དག་པ་སྟེ། །ཆོས་ཀྱི་མངའ་བདག་ཀུན་མཁྱེན་ཐུབ་པའི་དབང་། །མི་དང་ལྷས་མཆོད་ལྷ་ཡི་ལྷར་གྱུར་པ། །ཆོས་ལ་རང་བྱུང་མངའ་དབང་མཛད་ལ་རྟོན།
en: “Take as your master the one with natural mastery of the Dharma, An ocean of wisdom, with power both vast and pure, The sovereign of the Dharma, the all-knowing lord‌ of sages‌, A god of gods, revered by gods and humans alike.

source: །གང་ཞིག་གདུལ་དཀའི་སེམས་ལ་མངའ་མཛད་དེ། །གང་ཞིག་བདུད་ཀྱི་རྙི་ལས་གྲོལ་བའི་ཐུགས། །དེ་འདིར་མཐོང་ཐོས་དོན་མེད་མ་ཡིན་གྱིས། །རྣམ་གྲོལ་མཐར་ཕྱིན་ཞི་བའི་དྲུང་དུ་དེང་།
en: “Go before the Peaceful One, the One Who Is Liberated, He who has mastered those minds that are difficult to tame And whose own mind is free from the snares of Māra, For seeing him and hearing him is not without benefit.

source: །མཚུངས་མེད་ཆོས་ལ་སྣང་བར་གྱུར་པ་སྟེ། །མུན་སེལ་ཚུལ་བཟང་སྟོན་པར་རབ་མཛད་པ། །སངས་རྒྱས་སྤྱོད་ཞི་མཁྱེན་པ་དཔག་མེད་པ། །དེ་ཡི་དྲུང་དུ་དད་པ་མཆོག་གིས་དེང་།
en: “With supreme devotion, go, all of you, Before the One Who Is Peerless in Illuminating the Dharma, Who dispels darkness and shows the sublime way With peaceful conduct and knowledge infinite in scope.

source: །དེ་ནི་སྨན་པའི་རྒྱལ་པོ་བདུད་རྩི་གཏོང་།
en: “As the king of doctors, he dispenses divine nectar,

source: །དེ་ནི་སྨྲ་བ་དཔའ་བོ་ཚོགས་ངན་འཇོམས།
en: Conquering the evil hordes with his courageous eloquence.

source: །དེ་ནི་ཆོས་ཀྱི་རྩ་ལག་དོན་དམ་མཁས།
en: He is a friend of the Dharma and knows the ultimate.

source: །དེ་ནི་འདྲེན་པ་བླ་མེད་ལམ་སྟོན་པའོ།
en: He is a peerless guide who illuminates the path.”

source: །གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་སྔོན་གྱི་སངས་རྒྱས་རྗེས་སུ་དྲན་པར་བྱ་བ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་སྣང་བའི་འོད་ཟེར་དེས་ཕོག་ཅིང་ཚིགས་སུ་བཅད་པ་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་གིས་ཀྱང་བསྐུལ་མ་ཐག་ཏུ་རབ་ཏུ་ཞི་བའི་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་དག་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་རྗེས་སུ་དྲན་ཞིང་།
en: Struck by the light of wisdom free from attachment, which arouses the memory of the buddhas of times past, the gods of the pure realms were inspired by these verses and immediately arose from their tranquil absorptions.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་གང་ཡིན་པ་དག་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་གང་ཡིན་པ་དག་དང་། ཆོས་བསྟན་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་པར་གྱུར་ཏོ།
en: Through the power of the Buddha, they recalled the blessed buddhas of innumerable and incalculable eons, remembering the qualities of the buddha realms of each blessed buddha, as well as the retinue that surrounded the buddhas and the teachings they gave.

source: །དེ་ནས་དེའི་ནུབ་མོ་མི་ཉལ་ཙམ་ན་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དབང་ཕྱུག་ཅེས་བྱ་བ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དགའ་བོ་དང་། ཤིན་ཏུ་དགའ་བོ་དང་། ཙན་དན་དང་། མཆོད་བྱས་དང་། རབ་ཞི་དང་། དུལ་བ་རབ་ཞི་དབང་ཕྱུག་ལ་སོགས་པ་དེ་དག་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་གཞན་ཤིན་ཏུ་མང་པོ་ཁ་དོག་འཕགས་ཤིང་ཤིན་ཏུ་འཕགས་པ་དང་ལྡན་པ་དག་གིས།
en: That night, just as people went to bed, the gods of the pure realms visited the Blessed One. Among them were Īśvara, Maheśvara, Nanda, Sunanda, Candana, Mahita, Praśānta, Praśānta­vinīteśvara, and many other gods of the pure realms.

source: ལྷའི་སྣང་བས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ།
en: With their brilliant colors, they illuminated the entirety of Jeta Grove with a divine light.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: They prostrated to the Blessed One, placing their heads at his feet, and then stood to one side, supplicating him with the following words:

source: །བཅོམ་ལྡན་འདས་རྒྱ་ཆེར་རོལ་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་མདོ་སྡེ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོ་བསྡུས་པ།
en: “Blessed One, there is an extensive collection of discourses on the Dharma that bears the name Lalitavistara (The Play in Full).

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྟན་པ། དགའ་ལྡན་གྱི་ཕོ་བྲང་དམ་པ་ནས་འབབ་པ་དང་། ཆེད་དུ་དགོངས་ཏེ་ལྷུམས་སུ་འཇུག་པའི་རྣམ་པར་རོལ་པ་དང་། མངལ་གྱི་གནས་ཀྱི་ཁྱད་པར་ཀུན་ཏུ་བསྟན་པ།
en: This teaching illuminates the basic virtues of the bodhisattvas, showing how the Bodhisattva descended from the sublime palace in the Heaven of Joy, intentionally entered the womb, and sojourned in the womb.

source: རིགས་བཟང་པོར་སྐྱེ་བའི་སའི་མཐུ་ཀུན་དུ་བསྟན་པ། བྱིས་པའི་སྤྱོད་པ་ཐམས་ཅད་ལས་ཡོན་ཏན་གྱི་ཁྱད་པར་གྱིས་ཤིན་ཏུ་འདའ་བ་བསྟན་པ།
en: It shows the power of the place where he was born to a noble family, and how he surpassed others through all the superior special qualities that he demonstrated through his actions as a youth.

source: འཇིག་རྟེན་པའི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་དང་། ཡི་གེ་དང་། གྲངས་དང་། ལག་རྩིས་དང་། རྩིས་དང་། རལ་གྲིའི་ཐབས་དང་། འཕོང་དང་། སྟོབས་དང་། གྱད་ཀྱི་འཛིན་སྟངས་རྣམས་སེམས་ཅན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་ཀུན་དུ་བསྟན་པ།
en: It shows his many unique qualities, such as his skills in arts, crafts, writing, arithmetic, calculations, astrology, fencing, archery, feats of physical strength, and wrestling, demonstrating his superiority to all other beings in these areas.

source: བཙུན་མོའི་འཁོར་དང་། ཡུལ་གྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་པ།
en: It shows how he enjoyed his retinue of consorts and the pleasures of his kingdom.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་རྒྱུ་འཐུན་པས་ཡོངས་སུ་གྲུབ་པའི་འབྲས་བུ་བརྙེས་པ་ཡོངས་སུ་བརྗོད་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རོལ་པ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཇིག་པ་བསྟན་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་བསྡུས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མ་མཆིས་པ་ངེས་པར་བསྟན་པ། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་སྔོན་ཆད་གསུངས་པ་མཆིས་ཏེ། འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་པད་མའི་བླ་མ་དང་། ཆོས་ཀྱི་ཏོག་དང་། མར་མེ་མཛད་དང་། ཡོན་ཏན་གྱི་ཏོག་དང་། ཡོན་ཏན་འབྱུང་གནས་དང་། འོད་ཟེར་ཆེན་པོ་དང་། དྲང་སྲོང་ལྷ་དང་། དཔལ་གྱི་གཟི་བརྗིད་དང་། བདེན་པའི་ཏོག་དང་། རྡོ་རྗེ་མཁྲེགས་དང་། ཐམས་ཅད་ཟིལ་གྱིས་གནོན་དང་། གསེར་མདོག་དང་། ཤིན་ཏུ་མཐོར་གཤེགས་དང་། བྱི་རུའི་རྒྱ་མཚོ་དང་། མེ་ཏོག་གི་ཏོག་དང་། གཟུགས་བཟང་དང་། སྤྱན་བཟང་དང་། དྲང་སྲོང་སྦེད་དང་། དམག་ཚོགས་ལས་རྒྱལ་དང་། མཐོ་བ་དང་། མེ་ཏོག་རྒྱས་པ་དང་། མཛོད་སྤུ་གཟི་བརྗིད་དང་། ཤིན་ཏུ་རྒྱས་དང་། འོད་ཟེར་བཟང་པོ་དང་། བཀྲ་ཤིས་ལྡན་དང་། བལྟ་ན་བཟང་དང་། སེང་གེའི་གཟི་བརྗིད་ཆེན་པོ་དང་། བློ་གྲོས་བརྟན་པས་བྱིན་དང་། སོས་ཀའི་སྤོས་དྲི་དང་། བདེན་པའི་ཆོས་གྲགས་རྒྱ་ཆེན་དང་། འོད་ལྡན་དང་། སྐར་རྒྱལ་དང་། འཇིག་རྟེན་མཛེས་དང་། འོད་རྒྱ་ཆེན་དང་། རིན་ཆེན་གྲགས་དང་། དྲག་ཤུལ་གཟི་བརྗིད་དང་། རིན་ཆེན་གཟི་བརྗིད་དང་། ཚངས་པའི་གཟི་བརྗིད་དང་། སྒྲ་སྙན་དང་། མེ་ཏོག་བཟང་པོ་དང་། རི་རབ་མེ་ཏོག་དང་། རབ་ཏུ་ཡིད་འོང་དབྱངས་དང་། དགེ་བ་ཚུལ་བཟངས་དང་། རབ་ཏུ་འཛུམ་པའི་སྤྱན་དང་། ཡོན་ཏན་ཕུང་པོ་དང་། འབྲུག་སྒྲ་དང་། ཁ་དོག་མཛེས་དང་། ཚེའི་གཟི་བརྗིད་དང་། དོམ་བག་གླང་པོའི་འགྲོས་དང་། འཇིག་རྟེན་མངོན་པར་སྨོན་དང་། དགྲ་ལས་རྒྱལ་དང་། ཡང་དག་མཆོད་དང་། རྣམ་པར་གཟིགས་དང་། གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། འཁོར་བ་འཇིག་དང་། གསེར་ཐུབ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཀྱང་སྔོན་ཆད་གསུངས་པ་ལགས་ན།
en: “This teaching proclaims how he attained the result brought about by the concordant cause of all the bodhisattva activities, showing how he manifested as a bodhisattva and destroyed the legions of Māra. It explains the ten powers, the four fearlessnesses, and the other innumerable qualities of a thus-gone one, and presents the infinite teachings taught by the thus-gone ones of times past, including the blessed Padmottara, Dharmaketu, Dīpaṃkara, Guṇaketu, Mahākara, Ṛṣideva, Śrītejas, Satyaketu, Vajrasaṃhata, Sarvābhibhū, Hemavarṇa, Atyuccagāmin, Prabālasāgara, Puṣpaketu, Vararūpa, Sulocana, Ṛṣigupta, Jinavaktra, Unnata, Puṣpita, Ūrṇatejas, Puṣkara, Suraśmi, Maṅgala, Sudarśana, Mahā­siṃha­tejas, Sthita­buddhi­datta, Vasanta­gandhin, Satya­dharma­vipula­kīrti, Tiṣya, Puṣya, Lokasundara, Vistīrṇabheda, Ratnakīrti, Ugratejas, Brahmatejas, Sughoṣa, Supuṣpa, Sumanojñaghoṣa, Suceṣṭarūpa, Prahasitanetra, Guṇarāśi, Meghasvara, Sundaravarṇa, Āyustejas, Salīlagajagāmin, Lokābhilāṣita, Jitaśatru, Sampūjita, Vipaśyin, Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, and the Thus-Gone One, the Worthy One, the perfectly and completely awakened Kāśyapa.

source: དེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བ་དང་། སྨན་པ་དང་བདེ་བར་འགྱུར་བ་དང་། ཐེག་པ་ཆེན་པོ་འདིའང་བརྗོད་པ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅད་པ་དང་། བདུད་ཐམས་ཅད་ཟིལ་གྱིས་མནན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་བརྩམ་པ་བསྐྱེད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་གཅད་པ་དང་། སངས་རྒྱས་ཀྱི་མཛད་པ་ཡོངས་སུ་རྫོགས་པ་ཡང་ཀུན་ཏུ་བསྟན་པའི་སླད་དུ་ད་བསྟན་དུ་གསོལ་ཞེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་དག་དང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་ཅང་མི་གསུང་བས་གནང་ངོ་། །དེ་ནས་ལྷའི་བུ་དེ་དག་ཀྱང་།
en: “Blessed One, please teach this now to benefit the multitude of beings. Teach it to bring them happiness. Teach it out of compassion for the world, to benefit a great multitude of beings, gods and humans alike. Teach it to be our doctor and to bring us happiness. Teach it to propagate this Great Vehicle. Please teach it to defeat our opponents and overpower all demonic forces; to instruct all the bodhisattvas and inspire all those who follow the Bodhisattva Vehicle to arouse diligence; to embrace the true Dharma and ensure the continuity of the Three Jewels. Please teach it to illuminate all the enlightened activities of the Buddha.” Out of compassion for these gods, and indeed for the entire world including the gods, the Blessed One remained silent, thereby offering his consent.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: Seeing that this silence indicated the Blessed One’s consent, the gods were overjoyed and content.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཙན་དན་གྱི་ཕྱེ་མ་དང་། ཨ་ག་རུའི་ཕྱེ་མ་དང་། མེ་ཏོག་མན་དཱ་ར་བདག་གིས་ཀྱང་མངོན་པར་གཏོར་ཏེ།
en: With happiness and delight, they prostrated at his feet and circled him three times, scattering sandalwood powder, aloeswood powder, and māndārava flowers.

source: དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Then they vanished.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ནུབ་མོ་དེའི་ནམ་ནངས་པ་དང་། སྨྱིག་མའི་ལྡུམ་བུའི་འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས།
en: At dawn the next day, the Blessed One proceeded to a circular bamboo grove.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱིས་མདུན་གྱིས་བལྟས་ཏེ། གདན་བཤམས་པ་ལ་བཞུགས་སོ། །བཞུགས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Surrounded by the assembly of bodhisattvas, and with the saṅgha of listeners gathered before him, he sat down on the seat they had prepared and addressed the monks:

source: དགེ་སློང་དག་མདང་འདིར་ངའི་དྲུང་དུ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དབང་ཕྱུག་ཅེས་བྱ་བ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་དགའ་བོ་དང་། ཤིན་ཏུ་དགའ་བོ་དང་། ཙན་དན་དང་། མཆོད་བྱས་དང་། རབ་ཞི་དང་། དུལ་བ་རབ་ཞི་དབང་ཕྱུག་ལ་སོགས་པ་དེ་དག་དང་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་གཞན་ཤིན་ཏུ་མང་པོ་ཞེས་བྱ་བ་ནས།
en: “Monks, this evening a group of gods from the pure realms came before me. Among them were Īśvara, Maheśvara, Nanda, Sunanda, Candana, Mahita, Praśānta, Vinīteśvara, and many others.”

source: དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཅེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་གསུངས་སོ།
en: The Blessed One then continued to recount the events of the previous evening, up to the point where the gods disappeared.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Bowing before the Blessed One with palms joined, the bodhisattvas and great listeners then made the following request:

source: །བཅོམ་ལྡན་འདས་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེགས་པར་བསྟན་དུ་གསོལ།
en: “Blessed One! Please grant us the teaching entitled The Play in Full.

source: དེ་ནི་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བར་མཛད་པ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་དང་། ད་ལྟར་དང་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བར་འགྱུར་རོ་ཞེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: Please teach this now to benefit the multitude of beings and bring them happiness. Please teach it out of compassion for the world and to benefit the myriad of beings, gods and humans alike. Please teach it to benefit the bodhisattva great beings of the present as well as the future. Please teach it to bring benefit and happiness.” Out of compassion for the great bodhisattvas, for the great listeners, for gods, humans, and demigods, and indeed for the entire world, the Blessed One remained silent, thereby offering his consent.

source: །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: He then addressed the assembly:

source: དགེ་སློང་དག་ཀྱེ་ང་ནི་མདང་སུམ་འདིར། །གནས་པ་བཟང་པོས་བདེ་བར་གནས་གྱུར་ཅིང་། །ཉོན་མོངས་མེད་པར་རབ་ཏུ་གནས་གྱུར་ལ། །རྩེ་གཅིག་སེམས་སུ་མཉམ་པར་བཞག་དྲུང་དུ།
en: “Monks, last night as I rested here, Comfortable and free from afflictions, And dwelling evenly with one-pointed concentration, A group of gods arrived before me.

source: །རྫུ་འཕྲུལ་ཆེ་ཞིང་ཁ་དོག་བཟང་ལྡན་ལ།
en: “With great miraculous powers and brilliant colors,

source: །དྲི་མེད་དཔལ་འབར་ལྷ་ཡི་བུ་ལྷགས་ནས།
en: They were pristine, blazing with magnificence.

source: །དཔལ་གྱིས་རྒྱལ་བྱེད་ཚལ་འདི་སྣང་བྱས་ཏེ།
en: Illuminating Jeta Grove with their splendor,

source: །དགའ་བས་ང་ཡི་གན་དུ་མངོན་པར་ལྷགས།
en: They joyfully approached me.

source: །དབང་ཕྱུག་དབང་ཕྱུག་ཆེན་པོ་ཙན་དན་དང་། །དགའ་བོ་རབ་ཏུ་སེམས་ཞི་མཆོད་བྱས་དང་། །ཤིན་ཏུ་དགའ་བོ་ཞི་བ་ལྷ་ཡི་བུ། །བྱེ་བ་ལྷ་མང་དེ་དང་དེ་དག་རྣམས།
en: “There were millions of gods, Including Maheśvara, Candana, Īśvara, Nanda, Praśāntacitta, Mahita, Sunanda, And a god called Śānta.

source: །ང་ཡི་ཞབས་ལ་ཕྱག་འཚལ་བསྐོར་བྱས་ཏེ།
en: “They prostrated at my feet, circumambulated me,

source: །ང་ཡི་མདུན་དུ་འདིར་ནི་འཁོད་པར་གྱུར།
en: And gathered here before me.

source: །སོར་མོ་བཅུ་ཡིས་ཐལ་སྦྱར་གུས་བཅས་པར།
en: They joined their palms with respect

source: །དེ་དག་འདིར་ནི་ང་ལ་གསོལ་བ་བཏབ།
en: And offered me this request:

source: །འཇིག་རྟེན་ཀུན་ལ་སྨན་པའི་དོན་སླད་དུ།
en: “ ‘To benefit all the worlds,
